FranciszekJanicki/devcontainer-stm32-cubemx-invertedsway/Core/Src/mpu6050.cpp
    void MPU6050::set_interrupt_latch_clear(const std::uint8_t clear) const noexcept
    {
        std::uint8_t buffer = (clear & 1U) << INTCFG_LATCH_INT_EN_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_PIN_CFG,
                          sizeof(RA_INT_PIN_CFG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_int_enable_register(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = enable;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_int_data_ready_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << INTERRUPT_DATA_RDY_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    std::uint8_t MPU6050::get_int_status_register() const noexcept
    {
        std::uint8_t buffer;
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_INT_STATUS,
                         sizeof(RA_INT_STATUS),
                         &buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return buffer;
    }

    std::uint8_t MPU6050::get_device_id() const noexcept
    {
        std::uint8_t buffer;
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_WHO_AM_I,
                         sizeof(RA_WHO_AM_I),
                         &buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return buffer << 1;
    }

    void MPU6050::set_dhpf_mode(const std::uint8_t dhpf) const noexcept
    {
        std::uint8_t buffer = dhpf & 0x7;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_ACCEL_CONFIG,
                          sizeof(RA_ACCEL_CONFIG),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    std::uint8_t MPU6050::get_motion_status_register() const noexcept
    {
        std::uint8_t buffer;
        HAL_I2C_Mem_Read(this->i2c_,
                         this->address_,
                         RA_MOT_DETECT_STATUS,
                         sizeof(RA_MOT_DETECT_STATUS),
                         &buffer,
                         sizeof(buffer),
                         I2C_TIMEOUT);
        return buffer;
    }

    void MPU6050::set_int_zero_motion_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << INTERRUPT_ZMOT_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_int_motion_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << INTERRUPT_MOT_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_int_free_fall_enabled(const std::uint8_t enable) const noexcept
    {
        std::uint8_t buffer = (enable & 1U) << INTERRUPT_FF_BIT;
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_INT_ENABLE,
                          sizeof(RA_INT_ENABLE),
                          &buffer,
                          sizeof(buffer),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_motion_detection_threshold(std::uint8_t threshold) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_MOT_THR,
                          sizeof(RA_MOT_THR),
                          &threshold,
                          sizeof(threshold),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_motion_detection_duration(std::uint8_t duration) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_MOT_DUR,
                          sizeof(RA_MOT_DUR),
                          &duration,
                          sizeof(duration),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_zero_motion_detection_threshold(std::uint8_t threshold) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_ZRMOT_THR,
                          sizeof(RA_ZRMOT_THR),
                          &threshold,
                          sizeof(threshold),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_zero_motion_detection_duration(std::uint8_t duration) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_ZRMOT_DUR,
                          sizeof(RA_ZRMOT_DUR),
                          &duration,
                          sizeof(duration),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_free_fall_detection_threshold(std::uint8_t threshold) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_FF_THR,
                          sizeof(RA_FF_THR),
                          &threshold,
                          sizeof(threshold),
                          I2C_TIMEOUT);
    }

    void MPU6050::set_free_fall_detection_duration(std::uint8_t duration) const noexcept
    {
        HAL_I2C_Mem_Write(this->i2c_,
                          this->address_,
                          RA_FF_DUR,
                          sizeof(RA_FF_DUR),
                          &duration,
                          sizeof(duration),
                          I2C_TIMEOUT);
    }

}; // namespace InvertedSway